;---------------------------
; MrK's XCOM EU/EW Ports Tier 1 Armour
;---------------------------

;Helmets
;---------------------------
;Tier 1
;---------------------------
;Friendly
[X1_Helmet_Kevlar2_M X2BodyPartTemplate]
DisplayName="Kevlar Helmet"
[X1_Helmet_Kevlar2_F X2BodyPartTemplate]
DisplayName="Kevlar Helmet"

;Hyperion
[X1_Helmet_Soylent_M X2BodyPartTemplate]
DisplayName="X-COM Hyperion Helmet"
[X1_Helmet_Soylent_F X2BodyPartTemplate]
DisplayName="X-COM Hyperion Helmet"

;Carter
[X1_Carter_M X2BodyPartTemplate]
DisplayName="60s X-COM Fedora"
[X1_Carter_F X2BodyPartTemplate]
DisplayName="60s X-COM Fedora"

;Armour
;---------------------------

;Tier 1
;---------------------------
;Kevlar Armour
;---------------------------

;Kevlar Base Arms
[X1_KevlarLArm_K_F X2BodyPartTemplate]
DisplayName="Base Kevlar Arm"
[X1_KevlarRArm_K_F X2BodyPartTemplate]
DisplayName="Base Kevlar Arm"
[X1_KevlarRArm_K_M X2BodyPartTemplate]
DisplayName="Base Kevlar Arm"
[X1_KevlarLArm_K_M X2BodyPartTemplate]
DisplayName="Base Kevlar Arm"

;---------------------------
Deco Kevlar 1 Kit
;---------------------------
[Deco_KevlarR_K_F X2BodyPartTemplate]
DisplayName="Kevlar Soldier Kit"
[Deco_KevlarL_K_F X2BodyPartTemplate]
DisplayName="Kevlar Soldier Kit"
[Deco_KevlarR_K_M X2BodyPartTemplate]
DisplayName="Kevlar Soldier Kit"
[Deco_KevlarL_K_M X2BodyPartTemplate]
DisplayName="Kevlar Soldier Kit"

[Deco_KevlarARKitThigh_K_M X2BodyPartTemplate]
DisplayName="Kevlar Soldier Kit"
[Deco_KevlarARKitThigh_K_F X2BodyPartTemplate]
DisplayName="Kevlar Soldier Kit"

;---------------------------
Deco Kevlar 0
;---------------------------
[X1_KevlarDeco0_K_M X2BodyPartTemplate]
DisplayName="XCOM Hyperion Armour"
[X1_KevlarDeco0_K_F X2BodyPartTemplate]
DisplayName="XCOM Hyperion Armour"

[X1_KevlarRArmDeco0_K_F X2BodyPartTemplate]
DisplayName="XCOM Hyperion Armour"
[X1_KevlarLArmDeco0_K_F X2BodyPartTemplate]
DisplayName="XCOM Hyperion Armour"
[X1_KevlarRArmDeco0_K_M X2BodyPartTemplate]
DisplayName="XCOM Hyperion Armour"
[X1_KevlarLArmDeco0_K_M X2BodyPartTemplate]
DisplayName="XCOM Hyperion Armour"

[X1_KevlarDeco0Thighs_K_M X2BodyPartTemplate]
DisplayName="XCOM Hyperion Armour"
[X1_KevlarDeco0Thighs_K_F X2BodyPartTemplate]
DisplayName="XCOM Hyperion Armour"

[X1_KevlarDeco0ThighsNoStrap_K_M X2BodyPartTemplate]
DisplayName="XCOM Hyperion Armour No Strap"
[X1_KevlarDeco0ThighsNoStrap_K_F X2BodyPartTemplate]
DisplayName="XCOM Hyperion Armour No Strap"

[X1_KevlarDeco0Shins_K_M X2BodyPartTemplate]
DisplayName="XCOM Hyperion Armour"
[X1_KevlarDeco0Shins_K_F X2BodyPartTemplate]
DisplayName="XCOM Hyperion Armour"

;---------------------------
Deco Kevlar 1
;---------------------------
[X1_KevlarDeco1_K_M X2BodyPartTemplate]
DisplayName="XCOM Kevlar Vest"
[X1_KevlarDeco1_K_F X2BodyPartTemplate]
DisplayName="XCOM Kevlar Vest "

[X1_KevlarRArmDeco1_K_F X2BodyPartTemplate]
DisplayName="XCOM Kevlar Vest"
[X1_KevlarLArmDeco1_K_F X2BodyPartTemplate]
DisplayName="XCOM Kevlar Vest "
[X1_KevlarRArmDeco1_K_M X2BodyPartTemplate]
DisplayName="XCOM Kevlar Vest "
[X1_KevlarLArmDeco1_K_M X2BodyPartTemplate]
DisplayName="XCOM Soldier Knife"

[X1_KevlarDeco1Thighs_K_M X2BodyPartTemplate]
DisplayName="XCOM Kevlar Vest"
[X1_KevlarDeco1Thighs_K_F X2BodyPartTemplate]
DisplayName="XCOM Kevlar Vest"

[X1_KevlarDeco1Shins_K_M X2BodyPartTemplate]
DisplayName="XCOM Kevlar Vest"
[X1_KevlarDeco1Shins_K_F X2BodyPartTemplate]
DisplayName="XCOM Soldier Knife"

;---------------------------
Deco Kevlar SG 1 Kit
;---------------------------
[Deco_KevlarSGTorso_K_M X2BodyPartTemplate]
DisplayName="Kevlar Assault Kit"
[Deco_KevlarSGTorso_K_F X2BodyPartTemplate]
DisplayName="Kevlar Assault Kit"

[Deco_KevlarSGR_K_M X2BodyPartTemplate]
DisplayName="Kevlar Assault Kit"
[Deco_KevlarSGR_K_F X2BodyPartTemplate]
DisplayName="Kevlar Assault Kit"

[Deco_KevlarSGKitThigh_K_M X2BodyPartTemplate]
DisplayName="Kevlar Assault Kit"
[Deco_KevlarSGKitThigh_K_F X2BodyPartTemplate]
DisplayName="Kevlar Assault Kit"

;---------------------------
Deco Kevlar LMG 1 Kit
;---------------------------
[Deco_KevlarLMGTorso_K_M X2BodyPartTemplate]
DisplayName="Kevlar Heavy Kit"
[Deco_KevlarLMGTorso_K_F X2BodyPartTemplate]
DisplayName="Kevlar Heavy Kit"

[Deco_KevlarLMGR_K_M X2BodyPartTemplate]
DisplayName="Kevlar Heavy Kit"
[Deco_KevlarLMGL_K_M X2BodyPartTemplate]
DisplayName="Kevlar Heavy Kit"
[Deco_KevlarLMGR_K_F X2BodyPartTemplate]
DisplayName="Kevlar Heavy Kit"
[Deco_KevlarLMGL_K_F X2BodyPartTemplate]
DisplayName="Kevlar Heavy Kit"

[Deco_KevlarLMGRFore_K_M X2BodyPartTemplate]
DisplayName="Kevlar Heavy Kit"
[Deco_KevlarLMGLFore_K_M X2BodyPartTemplate]
DisplayName="Kevlar Heavy Kit"
[Deco_KevlarLMGRFore_K_F X2BodyPartTemplate]
DisplayName="Kevlar Heavy Kit"
[Deco_KevlarLMGLFore_K_F X2BodyPartTemplate]
DisplayName="Kevlar Heavy Kit"

[Deco_KevlarLMGKitThigh_K_M X2BodyPartTemplate]
DisplayName="Kevlar Heavy Kit"
[Deco_KevlarLMGKitThigh_K_F X2BodyPartTemplate]
DisplayName="Kevlar Heavy Kit"
